"Prevent accidental quitting" = "Prevent accidental quitting";
"Monthly" = "Kord kuus";
"Check for update immediately" = "Otsi uuendusi kohe";
"Add Quicksilver to your login items" = "Add Quicksilver to your login items";
"Download updates in the background" = "Laadi uuendused alla taustal";
"Restart immediately" = "Taaskäivita kohe";
"Warn before quitting" = "Hoiata enne väljalülitamist";
"Normal" = "Tavaline";
"Run Setup" = "Käivita seadistamine";
"Enable update checking" = "Luba uuenduste otsimine";
"Now" = "Kohe";
"⌽" = "⌽";